; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v1 ?v4)
             (pred_5 ?v7 ?v12)
             (pred_8 ?v1 ?v12)
             (pred_1 ?v6 ?v1 )
	     (pred_10 ?v1)
             (pred_2 ?v9)
             (pred_4 ?v7)
             (pred_9 ?v12)
             (pred_3 ?v1)
             (pred_6 ?v7)
             (pred_7 ?v1)
             (pred_11 ))



(:action op_2
:parameters (?v8 ?v13 ?v2 ?v3)
:precondition (and (pred_2 ?v8) (pred_2 ?v13) (pred_4 ?v2) (pred_9 ?v3)
          (pred_12 ?v8 ?v13) (pred_5 ?v2 ?v3)
                   (pred_8 ?v13 ?v3) (pred_10 ?v8) 
                   (pred_3 ?v13) (pred_6 ?v2))
:effect (and  (pred_7 ?v13) (not (pred_3 ?v13))))


(:action op_3
:parameters (?v8 ?v10)
:precondition (and (pred_2 ?v8) (pred_2 ?v10)
               (pred_10 ?v8) (pred_12 ?v8 ?v10) (pred_7 ?v10))
:effect (and (pred_10 ?v10) (not (pred_10 ?v8))))

(:action op_4
:parameters (?v8 ?v2)
:precondition (and (pred_2 ?v8) (pred_4 ?v2) 
                  (pred_10 ?v8) (pred_1 ?v2 ?v8) (pred_11 ))
:effect (and (pred_6 ?v2)
   (not (pred_1 ?v2 ?v8)) (not (pred_11 ))))


(:action op_1
:parameters (?v8 ?v11 ?v5)
:precondition (and (pred_2 ?v8) (pred_4 ?v11) (pred_4 ?v5)
                  (pred_10 ?v8) (pred_6 ?v5) (pred_1 ?v11 ?v8))
:effect (and (pred_6 ?v11) (pred_1 ?v5 ?v8)
        (not (pred_6 ?v5)) (not (pred_1 ?v11 ?v8))))

(:action op_5
:parameters (?v8 ?v2)
:precondition (and (pred_2 ?v8) (pred_4 ?v2) 
                  (pred_10 ?v8) (pred_6 ?v2))
:effect (and (pred_11 ) (pred_1 ?v2 ?v8) (not (pred_6 ?v2)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_17 obj_10 obj_21 obj_04 obj_11 obj_20 obj_27 obj_24 obj_18 obj_02 obj_05 obj_23 obj_15 obj_09 obj_01 obj_16 obj_22 obj_14 obj_08 obj_29 obj_03 obj_13 obj_19 obj_25 obj_26
    obj_30 obj_31 obj_06
    obj_28 obj_07 obj_12
    )

    (:init
       (pred_11)

       (pred_2 obj_17)
       (pred_2 obj_10)
       (pred_2 obj_21)
       (pred_2 obj_04)
       (pred_2 obj_11)
       (pred_2 obj_20)
       (pred_2 obj_27)
       (pred_2 obj_24)
       (pred_2 obj_18)
       (pred_2 obj_02)
       (pred_2 obj_05)
       (pred_2 obj_23)
       (pred_2 obj_15)
       (pred_2 obj_09)
       (pred_2 obj_01)
       (pred_2 obj_16)
       (pred_2 obj_22)
       (pred_2 obj_14)
       (pred_2 obj_08)
       (pred_2 obj_29)
       (pred_2 obj_03)
       (pred_2 obj_13)
       (pred_2 obj_19)
       (pred_2 obj_25)
       (pred_2 obj_26)
       (pred_9 obj_30)
       (pred_9 obj_31)
       (pred_9 obj_06)
       (pred_4 obj_28)
       (pred_4 obj_07)
       (pred_4 obj_12)

       (pred_12 obj_17 obj_20)
       (pred_12 obj_17 obj_10)
       (pred_12 obj_10 obj_27)
       (pred_12 obj_10 obj_21)
       (pred_12 obj_10 obj_17)
       (pred_12 obj_21 obj_24)
       (pred_12 obj_21 obj_04)
       (pred_12 obj_21 obj_10)
       (pred_12 obj_04 obj_18)
       (pred_12 obj_04 obj_11)
       (pred_12 obj_04 obj_21)
       (pred_12 obj_11 obj_02)
       (pred_12 obj_11 obj_04)
       (pred_12 obj_20 obj_05)
       (pred_12 obj_20 obj_27)
       (pred_12 obj_20 obj_17)
       (pred_12 obj_27 obj_23)
       (pred_12 obj_27 obj_24)
       (pred_12 obj_27 obj_10)
       (pred_12 obj_27 obj_20)
       (pred_12 obj_24 obj_15)
       (pred_12 obj_24 obj_18)
       (pred_12 obj_24 obj_21)
       (pred_12 obj_24 obj_27)
       (pred_12 obj_18 obj_09)
       (pred_12 obj_18 obj_02)
       (pred_12 obj_18 obj_04)
       (pred_12 obj_18 obj_24)
       (pred_12 obj_02 obj_01)
       (pred_12 obj_02 obj_11)
       (pred_12 obj_02 obj_18)
       (pred_12 obj_05 obj_16)
       (pred_12 obj_05 obj_23)
       (pred_12 obj_05 obj_20)
       (pred_12 obj_23 obj_22)
       (pred_12 obj_23 obj_15)
       (pred_12 obj_23 obj_27)
       (pred_12 obj_23 obj_05)
       (pred_12 obj_15 obj_14)
       (pred_12 obj_15 obj_09)
       (pred_12 obj_15 obj_24)
       (pred_12 obj_15 obj_23)
       (pred_12 obj_09 obj_08)
       (pred_12 obj_09 obj_01)
       (pred_12 obj_09 obj_18)
       (pred_12 obj_09 obj_15)
       (pred_12 obj_01 obj_29)
       (pred_12 obj_01 obj_02)
       (pred_12 obj_01 obj_09)
       (pred_12 obj_16 obj_03)
       (pred_12 obj_16 obj_22)
       (pred_12 obj_16 obj_05)
       (pred_12 obj_22 obj_13)
       (pred_12 obj_22 obj_14)
       (pred_12 obj_22 obj_23)
       (pred_12 obj_22 obj_16)
       (pred_12 obj_14 obj_19)
       (pred_12 obj_14 obj_08)
       (pred_12 obj_14 obj_15)
       (pred_12 obj_14 obj_22)
       (pred_12 obj_08 obj_25)
       (pred_12 obj_08 obj_29)
       (pred_12 obj_08 obj_09)
       (pred_12 obj_08 obj_14)
       (pred_12 obj_29 obj_26)
       (pred_12 obj_29 obj_01)
       (pred_12 obj_29 obj_08)
       (pred_12 obj_03 obj_13)
       (pred_12 obj_03 obj_16)
       (pred_12 obj_13 obj_19)
       (pred_12 obj_13 obj_22)
       (pred_12 obj_13 obj_03)
       (pred_12 obj_19 obj_25)
       (pred_12 obj_19 obj_14)
       (pred_12 obj_19 obj_13)
       (pred_12 obj_25 obj_26)
       (pred_12 obj_25 obj_08)
       (pred_12 obj_25 obj_19)
       (pred_12 obj_26 obj_29)
       (pred_12 obj_26 obj_25)
       (pred_3 obj_01)
       (pred_3 obj_24)
       (pred_3 obj_20)
       (pred_8  obj_01 obj_30)
       (pred_8  obj_24 obj_31)
       (pred_8  obj_20 obj_06)
       (pred_7 obj_17)
       (pred_7 obj_10)
       (pred_7 obj_21)
       (pred_7 obj_04)
       (pred_7 obj_11)
       (pred_7 obj_27)
       (pred_7 obj_18)
       (pred_7 obj_02)
       (pred_7 obj_05)
       (pred_7 obj_23)
       (pred_7 obj_15)
       (pred_7 obj_09)
       (pred_7 obj_16)
       (pred_7 obj_22)
       (pred_7 obj_14)
       (pred_7 obj_08)
       (pred_7 obj_29)
       (pred_7 obj_03)
       (pred_7 obj_13)
       (pred_7 obj_19)
       (pred_7 obj_25)
       (pred_7 obj_26)

       (pred_5  obj_28 obj_30)
       (pred_5  obj_07 obj_31)
       (pred_5  obj_12 obj_06)
       (pred_1 obj_28 obj_02)
       (pred_1 obj_07 obj_09)
       (pred_1 obj_12 obj_26)
       (pred_10 obj_02)
    )

    (:goal (and
       (pred_1 obj_28 obj_09)
    ))
(:constraints
  (always (not (pred_10 obj_18)))
)
)

; plan
1. (op_4 obj_02 obj_28)
   deleted: (pred_1 obj_28 obj_02) (pred_11)
   added: (pred_6 obj_28)
   goals met: 0 of 1
2. (op_2 obj_02 obj_01 obj_28 obj_30)
   deleted: (pred_3 obj_01)
   added: (pred_7 obj_01)
   goals met: 0 of 1
3. (op_3 obj_02 obj_01)
   deleted: (pred_10 obj_02)
   added: (pred_10 obj_01)
   goals met: 0 of 1
4. (op_3 obj_01 obj_09)
   deleted: (pred_10 obj_01)
   added: (pred_10 obj_09)
   goals met: 0 of 1
5. (op_1 obj_09 obj_07 obj_28)
   deleted: (pred_6 obj_28) (pred_1 obj_07 obj_09)
   added: (pred_6 obj_07) (pred_1 obj_28 obj_09)
   goals met: 1 of 1
